//-------------------------------------------------------------------------*
// 文件名: SCI.h                                                           *
// 说  明: SCI构件头文件                                                   *
//-------------------------------------------------------------------------*

#ifndef SCI_H
#define SCI_H

//头文件包含，及宏定义区

    //头文件包含
    #include "headers.h"     //包含总头文件
    
    //开放或禁止SCI的接收中断的宏定义
    #define EnableSCIReInt0            SCI0CR2 |= 0x20     //开放SCI0接收中断
    #define DisableSCIReInt0           SCI0CR2 &= 0xDF     //禁止SCI0接收中断
    #define EnableSCIReInt1            SCI1CR2 |= 0x20     //开放SCI1接收中断
    #define DisableSCIReInt1           SCI1CR2 &= 0xDF     //禁止SCI1接收中断
    
    //串行通信寄存器及标志位定义
    #define ReSendStatusR0             SCI0SR1  		   //SCI0状态寄存器
    #define ReSendDataR0               SCI0DRL  		   //SCI0数据寄存器

    #define ReSendStatusR1             SCI1SR1  		   //SCI0状态寄存器
    #define ReSendDataR1               SCI1DRL  		   //数据寄存器

    #define ReTestBit                  5        		   //接收缓冲区满标志位
    #define SendTestBit                7        		   //发送缓冲区空标志位


//构件函数声明区

    //---------------------------------------------------------------------*
    //函数名: SCIInit                                                      *
    //功  能: 初始化SCIx模块。x代表0，1                                    *
    //参  数: uint8 SCINo: 第SCINo个SCI模块。其中SCINo取值为0，1           *
    //                     如果SCINo大于1，则认为是1                       *
    //        uint8 sysclk: 系统总线时钟，以MHz为单位                      *
    //        uint16 baud:   波特率，如 4800，9600，19200，3840            *
    //                      其他的波特率在MC9SO8AW60的评估板上没有测试过， *
    //                      若要使用该函数，请自行测试，一般来说，速度慢一 *
    //                      点，通信会更稳定                               *
    //返  回: 无                                                           *
    //说  明: SCINo=0表示使用SCI0模块，依此类推。                          *
    //---------------------------------------------------------------------*
    void SCIInit(uint8 SCINo, uint8 sysclk, uint16 baud);           	     

    //---------------------------------------------------------------------*
    //函数名: SCISend1                                                     *
    //功  能: 串行发送1个字节                                              *
    //参  数: uint8 SCINo: 第SCINo个SCI模块，其中SCINo取值为0，1           *
    //        uint8 ch:    要发送的字节                                    *
    //返  回: 无                                                           *
    //说  明: SCINo=0表示使用SCI0模块，依此类推                            *
    //---------------------------------------------------------------------*
    void SCISend1(uint8 SCINo, uint8 ch);         	    

    //---------------------------------------------------------------------*
    //函数名: SCISendN                                                     *
    //功  能: 串行发送N个字节                                              *
    //参  数: uint8 SCINo: 第SCINo个SCI模块，其中SCINo取值为0，1           *
    //        uint8 n:      发送的字节数                                   *
    //        uint8 ch[]:   待发送的数据                                   *
    //返  回: 无                                                           *
    //说  明: SCINo=0表示使用SCI0模块，依此类推                            *
    //        调用了SCISend1函数                                           *
    //---------------------------------------------------------------------*
    void SCISendN(uint8 SCINo, uint8 n, uint8 ch[]);    

    //---------------------------------------------------------------------*
    //函数名: SCIRe1                                                       *
    //功  能: 从串口接收1个字节的数据                                      *
    //参  数: uint8 SCINo: 第SCINo个SCI模块，其中SCINo取值为0，1           *
    //返  回: 接收到的数(若接收失败，返回0xff)                             *
    //        uint8 *p:     接收成功标志的指针(0表示成功，1表示不成功)     *
    //说  明: 参数*p带回接收标志，*p = 0，收到数据；*p = 1，未收到数据     *
    //说  明: SCINo=0表示使用SCI0模块，依此类推                            *
    //---------------------------------------------------------------------*
    uint8 SCIRe1(uint8 SCINo, uint8 *p);               

    //---------------------------------------------------------------------*
    //函数名: SCIReN                                                       *
    //功  能: 从串口接收N个字节的数据                                      *
    //参  数: uint8 SCINo: 第SCINo个SCI模块，其中SCINo取值为0，1           *
    //        uint8 n:      要接收的字节数                                 *
    //        uint8 ch[]:   存放接收数据的数组                             *
    //返  回: 接收标志= 0 接收成功，= 1 接收失败                           *
    //说  明: SCINo=0表示使用SCI1模块，依此类推                            *
    //        调用了SCIRe1函数                                             *
    //---------------------------------------------------------------------*
    uint8 SCIReN(uint8 SCINo, uint8 n, uint8 ch[]);
    
    //---------------------------------------------------------------------*
    //函数名: SCISendString                                                *
    //功  能: 串口传输字符串                                               *
    //参  数: uint8 SCINo: 第SCINo个SCI模块，其中SCINo取值为0，1           *
    //        char *p: 要传输的字符串的指针                                *
    //返  回: 无                                                           *
    //说  明: 字符串以'\0'结束                                             *
    //        调用了SCISend1 函数                                          *
    //---------------------------------------------------------------------*
    void SCISendString(uint8 SCINo,char *p);     
#endif
